---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceRule.RoutingPreferenceManager
source: html/e340755c-76a9-019c-2d1e-91a221ec1ef4.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRule.RoutingPreferenceManager Property

Gets the routing preference manager that owns this rule.

## Syntax (C#)
```csharp
public RoutingPreferenceManager RoutingPreferenceManager { get; }
```